app/views/articles/_comments.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 13]]
---
		<div class="col-xs-6">
			<%= @article.comments.count %> Comentario(s)