app/controllers/articles_controller.rb

	def index
	# Todos los registros SELECT * FROM articles
		@articles = Article.paginate(page: params[:page],per_page:6).publicados.ultimos
---
SELECT "articles".* FROM "articles"

	def create
		#INSERT INTO
		@article = current_user.articles.new(article_params)
		@article.categories = params[:categories]
		if @article.save
---
INSERT INTO "articles" ("title", "body", "visits_count", "created_at", "updated_at", "cover_file_name", "cover_content_type", "cover_file_size", "cover_updated_at", "user_id", "markup_body") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "has_categories" ("article_id", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["article_id", 15], ["category_id", 1], ["created_at", "2017-08-09 02:43:50.169586"], ["updated_at", "2017-08-09 02:43:50.169586"]]

	def destroy
		#DELETE FROM articles

		@article.destroy # Destroy elimina el objeto de la BD
---
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 4]]

	def update
		# UPDATE
		# @article.update_attributes ({title: 'Nuevo Título'})
		if @article.update(article_params)
---
UPDATE "articles" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "Mi primer artículo hecho en Rails"], ["body", "Este es mi primer artículo creado con Rails en método CRUD"], ["updated_at", "2017-08-07 22:49:51.867194"], ["id", 1]]