app/controllers/comments_controller.rb

  def create
    @comment = current_user.comments.new(comment_params)
    @comment.article = @article
    respond_to do |format|
      if @comment.save
---
INSERT INTO "comments" ("user_id", "article_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["article_id", 1], ["body", "Este es un comentario"], ["created_at", "2017-08-08 05:43:27.969786"], ["updated_at", "2017-08-08 05:43:27.969786"]]