app/controllers/welcome_controller.rb

  	def dashboard
  		@articles = Article.all
---
SELECT "articles".* FROM "articles"